public/4clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-22 Mon 15:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>4Clojure</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yosevu Kilonzo" />
<link rel='stylesheet' href='css/main.css' type='text/css'/>
</head>
<body>
<div id="content">
<h1 class="title">4Clojure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged73a12">1. Nothing but the Truth</a></li>
<li><a href="#orgad45c0e">2. Simple Math</a></li>
<li><a href="#orgc43b47d">3. Intro to strings</a></li>
<li><a href="#org8ee8c33">4. Intro to lists</a></li>
<li><a href="#orgd406a75">5. Lists: conj</a></li>
<li><a href="#orgea90cb7">6. Intro to vectors</a></li>
<li><a href="#org6d50657">7. Vectors: conj</a></li>
<li><a href="#org0c82e61">8. Intro to sets</a></li>
<li><a href="#orgbdb3fa6">9. Sets: conj</a></li>
<li><a href="#orge42f0bb">10. Intro to maps</a></li>
<li><a href="#orgc59444d">19. Last element</a></li>
<li><a href="#orge01363e">20. Penultimate element</a></li>
<li><a href="#org3dc711a">21. Nth element</a></li>
<li><a href="#orgf93a721">22. Count a sequence</a></li>
<li><a href="#org0d04efb">23. Reverse a sequence</a></li>
<li><a href="#org945fd79">24. Sum it all up</a></li>
<li><a href="#org1bcd010">25. Find the odd numbers</a></li>
<li><a href="#org8ac5df0">26. Fibonacci sequence</a></li>
<li><a href="#org6147db0">27. TODO</a></li>
<li><a href="#orgafc52b1">28. Flatten a sequence</a></li>
<li><a href="#org655d113">Backlinks</a></li>
</ul>
</div>
</div>
<p>
Annotated solutions to 4Clojure&rsquo;s <a href="clojure.html">Clojure</a> problems.
</p>

<div id="outline-container-orged73a12" class="outline-2">
<h2 id="orged73a12">1. Nothing but the Truth</h2>
<div class="outline-text-2" id="text-orged73a12">
<p>
This is a clojure form. Enter a value which will make the form evaluate to true.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">nothing-but-truth</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #6c71c4; font-weight: bold;">true</span> <span style="color: #6c71c4; font-weight: bold;">true</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad45c0e" class="outline-2">
<h2 id="orgad45c0e">2. Simple Math</h2>
<div class="outline-text-2" id="text-orgad45c0e">
<p>
If you are not familiar with polish notation, simple arithmetic might seem confusing.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">simple-math</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #859900;">(</span>- <span style="color: #6c71c4; font-weight: bold;">10</span> <span style="color: #268bd2;">(</span>* <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc43b47d" class="outline-2">
<h2 id="orgc43b47d">3. Intro to strings</h2>
<div class="outline-text-2" id="text-orgc43b47d">
<p>
Clojure strings are Java strings. This means that you can use any of the Java string methods on Clojure strings.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">intro-to-strings</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #2aa198;">"HELLO WORLD"</span> <span style="color: #859900;">(</span>.toUpperCase <span style="color: #2aa198;">"hello world"</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ee8c33" class="outline-2">
<h2 id="org8ee8c33">4. Intro to lists</h2>
<div class="outline-text-2" id="text-org8ee8c33">
<p>
Lists can be constructed with either a function or a quoted form.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">intro-to-lists</span> <span style="color: #d33682;">[]</span>
    <span style="color: #d33682;">(</span>= <span style="color: #859900;">(</span>list <span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #859900;">)</span> '<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd406a75" class="outline-2">
<h2 id="orgd406a75">5. Lists: conj</h2>
<div class="outline-text-2" id="text-orgd406a75">
<p>
When operating on a list, the conj function will return a new list with one or more items &ldquo;added&rdquo; to the front.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">lists-conj</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= '<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>conj '<span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>= '<span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span> <span style="color: #268bd2;">(</span>conj '<span style="color: #d33682;">(</span><span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #d33682;">)</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">1</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgea90cb7" class="outline-2">
<h2 id="orgea90cb7">6. Intro to vectors</h2>
<div class="outline-text-2" id="text-orgea90cb7">
<p>
Vectors can be constructed several ways. You can compare them with lists.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">intro-to-vectors</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #859900;">[</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #859900;">]</span> <span style="color: #859900;">(</span>list <span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>vec '<span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>vector <span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d50657" class="outline-2">
<h2 id="org6d50657">7. Vectors: conj</h2>
<div class="outline-text-2" id="text-org6d50657">
<p>
When operating on a Vector, the conj function will return a new vector with one or more items &ldquo;added&rdquo; to the end.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">vectors-conj</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #859900;">[</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">]</span> <span style="color: #859900;">(</span>conj <span style="color: #268bd2;">[</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span><span style="color: #268bd2;">]</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>= <span style="color: #859900;">[</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">]</span> <span style="color: #859900;">(</span>conj <span style="color: #268bd2;">[</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span><span style="color: #268bd2;">]</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
<code>conj</code> is a clipping, (technically apocope) of conjoin.
</p>
</div>
</div>
