4clojure.org
* 8. Intro to sets

Sets are collections of unique values.

#+BEGIN_SRC clojure
(defn intro-to-sets []
  (= #{:a :b :c :d} (set '(:a :a :b :c :c :c :c :d :d)))
  (= #{:a :b :c :d} (clojure.set/union #{:a :b :c} #{:b :c :d})))
#+END_SRC

#+BEGIN_QUOTE
In [[file:set-theory.org][set theory]], the union of a collection of sets is the set of all elements in the collection. - [[https://en.wikipedia.org/wiki/Union_(set_theory)][Union (set theory), Wikipedia]]
#+END_QUOTE

In the second example above, there are two sets in the collection.

1. ~#{:a :b :c}~
1. ~#{:b :c :d}~

The union of the sets A and B (A ∪ B) is the set ~#{:a :b :c :d}~.

*Clojure Notes*
- ~=~ returns ~true~ when called as a unary function (with one argument): ~(= 1)~.

* 9. Sets: conj

When operating on a set, the conj function returns a new set with one or more keys "added".

#+BEGIN_SRC clojure
(defn sets-conj []
  (= #{1 2 3 4} (conj #{1 4 3} 2)))

#+END_SRC

* 10. Intro to maps

Maps store key-value pairs. Both maps and keywords can be used as lookup functions. Commas can be used to make maps more readable, but they are not required.

#+BEGIN_SRC clojure
(defn intro-to-maps []
  (= 20 ((hash-map :a 10 :b 20 :c 30) :b))
  (= 20 (:b {:a 10 :b 20 :c 30})))
#+END_SRC

* 19. Last element

- Difficulty: Easy
- Topics: seqs core-functions
- Effort: 🧠

Write a function which returns the last element in a sequence.

Special Restrictions: last

*Iteration 1*

#+BEGIN_SRC clojure
(defn last-element [s]
  (nth s (- (count s) 1)))
#+END_SRC

*Other solutions*

#+BEGIN_SRC clojure
(defn last-element [s]
  (nth s (dec (count s)))
#+END_SRC

* 20. Penultimate element

- Difficulty: Easy
- Topics: seqs
- Effort: 🧠

Write a function which returns the second to last element from a sequence.

*Iteration 1*

#+BEGIN_SRC clojure
(defn penultimate-element [s]
  (nth s (- (count s) 2)))
#+END_SRC

*Other solutions*

#+BEGIN_SRC clojure
(defn penultimate-element [s]
  (comp second reverse))
#+END_SRC

* 21. Nth element

- Difficulty: Easy
- Topics: seqs core-functions
- Effort: 🧠

Write a function which returns the Nth element from a sequence.

Special Restrictions: nth

*Iteration 1*

#+BEGIN_SRC clojure
(defn nth-element [s index]
  (get (vec s) index))
#+END_SRC

*Other solutions*

#+BEGIN_SRC clojure
(defn nth-element [coll n]
  (first (drop n coll)))
#+END_SRC

