public/4clojure.html

<div id="outline-container-org0c82e61" class="outline-2">
<h2 id="org0c82e61">8. Intro to sets</h2>
<div class="outline-text-2" id="text-org0c82e61">
<p>
Sets are collections of unique values.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">intro-to-sets</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= #<span style="color: #859900;">{</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:d</span><span style="color: #859900;">}</span> <span style="color: #859900;">(</span>set '<span style="color: #268bd2;">(</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:d</span> <span style="color: #6c71c4; font-weight: bold;">:d</span><span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>= #<span style="color: #859900;">{</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:d</span><span style="color: #859900;">}</span> <span style="color: #859900;">(</span><span style="color: #b58900; font-style: italic;">clojure.set</span>/union #<span style="color: #268bd2;">{</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span><span style="color: #268bd2;">}</span> #<span style="color: #268bd2;">{</span><span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">:d</span><span style="color: #268bd2;">}</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<blockquote>
<p>
In <a href="set-theory.html">set theory</a>, the union of a collection of sets is the set of all elements in the collection. - <a href="https://en.wikipedia.org/wiki/Union_(set_theory)">Union (set theory), Wikipedia</a>
</p>
</blockquote>

<p>
In the second example above, there are two sets in the collection.
</p>

<ol class="org-ol">
<li><code>#{:a :b :c}</code></li>
<li><code>#{:b :c :d}</code></li>
</ol>

<p>
The union of the sets A and B (A ∪ B) is the set <code>#{:a :b :c :d}</code>.
</p>

<p>
<b>Clojure Notes</b>
</p>
<ul class="org-ul">
<li><code>=</code> returns <code>true</code> when called as a unary function (with one argument): <code>(= 1)</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbdb3fa6" class="outline-2">
<h2 id="orgbdb3fa6">9. Sets: conj</h2>
<div class="outline-text-2" id="text-orgbdb3fa6">
<p>
When operating on a set, the conj function returns a new set with one or more keys &ldquo;added&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">sets-conj</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= #<span style="color: #859900;">{</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">2</span> <span style="color: #6c71c4; font-weight: bold;">3</span> <span style="color: #6c71c4; font-weight: bold;">4</span><span style="color: #859900;">}</span> <span style="color: #859900;">(</span>conj #<span style="color: #268bd2;">{</span><span style="color: #6c71c4; font-weight: bold;">1</span> <span style="color: #6c71c4; font-weight: bold;">4</span> <span style="color: #6c71c4; font-weight: bold;">3</span><span style="color: #268bd2;">}</span> <span style="color: #6c71c4; font-weight: bold;">2</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orge42f0bb" class="outline-2">
<h2 id="orge42f0bb">10. Intro to maps</h2>
<div class="outline-text-2" id="text-orge42f0bb">
<p>
Maps store key-value pairs. Both maps and keywords can be used as lookup functions. Commas can be used to make maps more readable, but they are not required.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">intro-to-maps</span> <span style="color: #d33682;">[]</span>
  <span style="color: #d33682;">(</span>= <span style="color: #6c71c4; font-weight: bold;">20</span> <span style="color: #859900;">(</span><span style="color: #268bd2;">(</span>hash-map <span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">10</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">20</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">30</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4; font-weight: bold;">:b</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
  <span style="color: #d33682;">(</span>= <span style="color: #6c71c4; font-weight: bold;">20</span> <span style="color: #859900;">(</span><span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #268bd2;">{</span><span style="color: #6c71c4; font-weight: bold;">:a</span> <span style="color: #6c71c4; font-weight: bold;">10</span> <span style="color: #6c71c4; font-weight: bold;">:b</span> <span style="color: #6c71c4; font-weight: bold;">20</span> <span style="color: #6c71c4; font-weight: bold;">:c</span> <span style="color: #6c71c4; font-weight: bold;">30</span><span style="color: #268bd2;">}</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
&lt;hr&gt;
</p>
</div>
</div>

<div id="outline-container-orgc59444d" class="outline-2">
<h2 id="orgc59444d">19. Last element</h2>
<div class="outline-text-2" id="text-orgc59444d">
<ul class="org-ul">
<li>Difficulty: Easy</li>
<li>Topics: seqs core-functions</li>
<li>Effort: 🧠</li>
</ul>

<p>
Write a function which returns the last element in a sequence.
</p>

<p>
Special Restrictions: last
</p>

<p>
<b>Iteration 1</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">last-element</span> <span style="color: #d33682;">[</span>s<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>nth s <span style="color: #859900;">(</span>- <span style="color: #268bd2;">(</span>count s<span style="color: #268bd2;">)</span> <span style="color: #6c71c4; font-weight: bold;">1</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
<b>Other solutions</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">last-element</span> <span style="color: #d33682;">[</span>s<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>nth s <span style="color: #859900;">(</span>dec <span style="color: #268bd2;">(</span>count s<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge01363e" class="outline-2">
<h2 id="orge01363e">20. Penultimate element</h2>
<div class="outline-text-2" id="text-orge01363e">
<ul class="org-ul">
<li>Difficulty: Easy</li>
<li>Topics: seqs</li>
<li>Effort: 🧠</li>
</ul>

<p>
Write a function which returns the second to last element from a sequence.
</p>

<p>
<b>Iteration 1</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">penultimate-element</span> <span style="color: #d33682;">[</span>s<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>nth s <span style="color: #859900;">(</span>- <span style="color: #268bd2;">(</span>count s<span style="color: #268bd2;">)</span> <span style="color: #6c71c4; font-weight: bold;">2</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
<b>Other solutions</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">penultimate-element</span> <span style="color: #d33682;">[</span>s<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>comp second reverse<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dc711a" class="outline-2">
<h2 id="org3dc711a">21. Nth element</h2>
<div class="outline-text-2" id="text-org3dc711a">
<ul class="org-ul">
<li>Difficulty: Easy</li>
<li>Topics: seqs core-functions</li>
<li>Effort: 🧠</li>
</ul>

<p>
Write a function which returns the Nth element from a sequence.
</p>

<p>
Special Restrictions: nth
</p>

<p>
<b>Iteration 1</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">nth-element</span> <span style="color: #d33682;">[</span>s index<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>get <span style="color: #859900;">(</span>vec s<span style="color: #859900;">)</span> index<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
<b>Other solutions</b>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #b58900;">nth-element</span> <span style="color: #d33682;">[</span>coll n<span style="color: #d33682;">]</span>
  <span style="color: #d33682;">(</span>first <span style="color: #859900;">(</span>drop n coll<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
